Testcases/SoapLibrary/XML/New_Request.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Add xmlns="http://tempuri.org/">
            <intA>100</intA>
            <intB>100</intB>
        </Add>
    </Body>
</Envelope>