RESTAssuredAutomation/SoapRequest/add.xml

<!--<Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">-->
<Envelope xmlns="http://www.schemas.xmlsoap.org/soap/envelope">
  <Body>
    <Add xmlns="http://tempuri.org/">
      <intA>2</intA>
      <intB>5</intB>
    </Add>
  </Body>
</Envelope>